print('вы лежали в кровати и спали как вдруг проснулись от страннного шума,вы посмотрели на время,на часах было 3 часа ночи.что вы выберете остатся в кровати(y)или пойти проверить источник шума (x)')
qfirst = input('введите вариант ответа')
if qfirst == 'y':
    print ('вы остались прятатся в кровати а шум превратился в страшные звуки которые постепенно приближались к вам,что вы решите делать прятяться(X) защиатся(Y)')
    qsec = input('введите вариант ответа')
    if qsec == 'y':
        print ('вы оглядели комнату и обнаружили телефон(x)ящик с оружием(y) и лопату(z)')
        qsrd =input('введите вариант ответа')
        if qsec == 'x':
            print ('вы взяли свой телефон и спрятались под одеялом')
        print ('нечто зашло в комнату и оказалось что это был напившийся отчим который хочет использовать вас как закуску,он ходил по комнате в поисках вас и у вас осталось чуть больше минуты чтобы что нибудь предпренять,вы открывайте телефон открыть папку игры(x)позвонить спасателям (y)написать мачехе  которая спала дома (z)
            if qfth == 'x':
                print('выберете игру 
        elif qsrd == 'y':
            print('вы открыли ящик с оружием и нашли там дробовик(x(отсылка на ульту шелли тип чел говорит летс гоу блен блен и ультует разнося все на своем пути))зонтик(y(отсылка на ульт пайпер набиваешь ульту и улетаешь но разносишь хату и тебя убивает мать)и шарф(Z(ты превращаешся в zxc гуля дединсайда,пробиваешь отчима кагуне и говоришь 1000-7 и наносиш 9999 ударов а потом люто крутишся с дизом ))')
        elif qsrd == 'z':
            print('вы взяли лопату но она слишком большая чтобы прятатся в кровати поэтому вы спрятались в шкафу')
    elif qsec == 'x':
        print('-')







elif qfirst == 'x':
    print('-')

     